[
    {
      "year": "2023 - present",
      "title": "Full-Stack Software Engineering Learning Assistant",
      "duration": "1 year",
      "details":
        "Assist students with their programming assignments through a chat service offered by the program. Provide helpful and detailed feedback after thoroughly reviewing their code. Offer students a path forward with their assignment once the issue is located and resolved. Occasionally have one-on-one Zoom calls to assist students with their issues better. Students very often offer 5-star ratings based on their interactions with me. Always go above and beyond to ensure the students have all the necessary tools and information to move forward with their assignments.",
        "codeBadge" : true
    },
    {
      "year": "2023 - present",
      "title": "Full-Stack Software Engineering Central Grader",
      "duration": "1 year",
      "details":
        "Grade completed student assignments through an online grading portal. Offer detailed feedback based on their work and a final grade. Feedback and score are sent to the student's instructor for review. Receive positive monthly feedback from management based on feedback and writing style. Management appreciates my initiative when reaching out regarding unique issues and situations.",
        "codeBadge" : true
    },
    {
      "year": "2022 - 2023",
      "title": "Graphic Designer",
      "duration": "1 year",
      "details":
        "Design logos / internal & external marketing material for many of the company’s brands. Maintain clear communication with the client during the design process to ensure success. Use industry-standard design software such as Photoshop, Illustrator, and InDesign."
    },
    {
      "year": "2020 - 2021",
      "title": "Inside Sales Representative - So. Cal & H.I.",
      "duration": "2 years",
      "details":
        "Managed & grew accounts in Southern California and Hawaii territory for Gemline Thought outside the box to service clients in a quick and detailed fashion. For example, used my design skills to produce virtual mockups of products in record time which helped close sales faster. Handled client emails and calls regarding stock, pricing, decoration guidelines, deadlines, shipping, and any other question the company might have about our products. Maintained a great amount of knowledge of our products as well as competitor’s products. Organized meetings with potential clients and created slides to sell and present Gemline Products. Met sales goals for the first time in three years after my arrival and helped expand Gemline’s market share in my assigned territories. Helped upper management decide what products to sell next and keep a large stock. Developed the skills necessary to negotiate and close deals despite roadblocks such as maybe their preferred item not being available, pricing, etc. Keep track of orders and notify clients of any delays in their orders."
    },
    {
      "year": "2016 - 2019",
      "title": "Front Desk Agent",
      "duration": "4 years",
      "details":
        "Consistently met and surpassed quotas on signing up guests to the hotel’s rewards program. Usually mentioned by name in 5-star reviews. Frequently received very positive feedback on performance and guest interactions. Worked in a fast-paced environment that included frequent interaction with guests, with a goal to accommodate their needs in a polite and efficient matter. Filed end-of-day reports for the hotel’s daily earnings."
    },
    {
      "year": "2019",
      "title": "Sales Consultant",
      "duration": "1 years",
      "details":
        "Helped customers select the right vehicle for their needs. Took customers on test drives while further explaining the vehicle’s features. Negotiated and closed deals with customers. Prepared and delivered cars to customers and explained any modifications that the vehicle had received and ensured customers know how to comfortably use the car’s features. Received positive reviews, feedback, and emails from customers. Kept up with sales inventory and locations throughout the lot. Regularly worked on improving product knowledge as new cars and features were released."
    }
  ]